#include <iostream>
#include <windows.h>
#include <algorithm>
using namespace std;

//class Array {
//	unsigned int capacity = 10; // при створенні масиву, він одразу для себе робить запас пам'яті на 10 елементів
//	int* data = new int[capacity];
//	unsigned int length = 0; // фактична (реальна) кількість елементів, присутніх у масиві
//
//public:
//	Array() {}
//
//	void AddToBack(int value) {
//		if (length < capacity) // якщо виділенної зарання пам'яті ВИСТАЧАЄ для додавання чергового елемента
//			data[length] = value;
//		else { // АЛЕ ЯКЩО МІСЦЯ ВЖЕ НЕ ВИСТАЧАЄ, ТО
//			// треба перевиділити пам'ять
//			capacity *= 2; // збільшуємо запас пам'яті у 2 рази (можна і в 1.5, можна і в 1.2)
//			// якщо був запас 10 елементів, то стане 20
//			// якщо запас був 20 елементів, то стане 40, і тд
//			int* temp = new int[capacity]; // новий масив буде в 2 рази більше по пам'яті
//			// але в старому масиві все ще усього 10 елементів, тому цикл треба написати так, щоб зачепити лише старі елементі зі старого масиву
//			for (int i = 0; i < length; i++) {
//				temp[i] = data[i];
//			}
//			// в новий масив в кінець (по індексу 10) пишеться ОДИНАДЦЯТИЙ елемент
//			temp[length] = value;
//			delete[] data; // в цілях запобігання витокам пам'яті, чистимо пам'ять від старого масиву
//			data = temp; // переставляємо покажчик на новий масив
//		}
//		length++;
//	}
//
//	void AddToFront(int value) {
//		if (length < capacity) { // ще є вільна пам'ять під черговий елмент
//			// перевиділяти пам'ять на 1 елемент кожен раз - погана ідея (якщо елементів буде більше ніж 300000+ то все буде відбуватися максимально повільно)
//			// при тому що пам'ять вже виділена (є кепесіті), то доведеться зробити зсув для всіх існуючих елементів на 1 вправо
//			for (int i = length - 1; i >= 0; i--) { // зсув іде справа наліво (тому що якщо робити його зліва направо, з початку масива в кінець) то можна втратити існуючі елементи
//				data[i + 1] = data[i];
//			}
//			data[0] = value;
//		}
//		else { // АЛЕ ЯКЩО МІСЦЯ ВЖЕ НЕ ВИСТАЧАЄ, ТО
//			// треба перевиділити пам'ять
//			capacity *= 2; // збільшуємо запас пам'яті у 2 рази (можна і в 1.5, можна і в 1.2)
//			// якщо був запас 10 елементів, то стане 20
//			// якщо запас був 20 елементів, то стане 40, і тд
//			int* temp = new int[capacity]; // новий масив буде в 2 рази більше по пам'яті
//			// але в старому масиві все ще усього 10 елементів, тому цикл треба написати так, щоб зачепити лише старі елементі зі старого масиву
//			for (int i = 0; i < length; i++) {
//				temp[i + 1] = data[i];
//			}
//			// в новий масив в початок (по індексу 0) пишеться ОДИНАДЦЯТИЙ елемент
//			temp[0] = value;
//			delete[] data; // в цілях запобігання витокам пам'яті, чистимо пам'ять від старого масиву
//			data = temp; // переставляємо покажчик на новий масив
//		}
//		length++;
//	}
//
//	void RemoveByValue(int value) {
//		if (length == 0) {
//			cout << "Масив порожній, немає що видаляти!\n";
//			return;
//		}
//
//		int index = -1;
//		for (int i = 0; i < length; ++i) {
//			if (data[i] == value) {
//				index = i;
//				break;
//			}
//		}
//
//		if (index == -1) {
//			cout << "Елемент зі значенням " << value << " не знайдено!\n";
//			return;
//		}
//
//		// Зсуваємо всі елементи після index на одну позицію вліво
//		for (int i = index; i < length - 1; ++i) {
//			data[i] = data[i + 1];
//		}
//
//		length--;
//		cout << "Елемент зі значенням " << value << " видалено.\n";
//	}
//
//
//
//	void RemoveFromBack() {
//		if (length == 0) {
//			cout << "масив пустий, видаляти НЕМА ЧОГО!\n";
//			return;
//		}
//		length--;
//	}
//
//	void Print() const {
//		if (length == 0) {
//			cout << "масив пустий!\n";
//		}
//		else {
//			cout << "елементи масиву: ";
//			for (int i = 0; i < length; i++)
//			{
//				cout << data[i] << " ";
//			}
//			cout << "\n";
//		}
//	}
//
//	~Array() {
//		cout << "D-TOR\n";
//		if (data != nullptr) {
//			delete[] data;
//		}
//	}
//
//	Array(const Array& original) {
//		cout << "COPY C-TOR\n";
//		this->length = original.length;
//		this->capacity = original.capacity;
//		this->data = new int[capacity];
//		for (int i = 0; i < length; i++)
//			this->data[i] = original.data[i];
//	}
//};
//
//// загальний синтаксис як зробити перевантаження у вигляді глобальної функції
//
//// тип_результату operator значок_операції (параметри) {
//	// список дій
//// }
//
//
//
//void operator +=(Array& a, int value) {
//	cout << "HELLO FROM += function !!!\n";
//	a.AddToBack(value);
//}
//
//void operator -=(Array& a, int value) {
//	cout << "HELLO FROM -= function !!!\n";
//	a.RemoveByValue(value);
//}
//
//
//// кількість параметрів - або 1, або 2
//// якщо перевантажується унарний оператор, то параметр 1  ! - ~ ++ --
//// якщо бінарний оператор, то параметра 2
//
//int main() {
//	SetConsoleOutputCP(1251);
//	srand(time(0));
//
//	Array a;
//	a.Print(); // ...
//
//	a.AddToFront(10); // 10
//	a.Print(); // 10
//
//	a += 20; // a.AddToFront(20); // 10 20
//	a.Print(); // 10 20
//
//	operator+=(a, 30); // 10 20 30
//	a.Print(); // 10 20 30
//
//	operator-=(a, 30); // видаляємо 20
//	a.Print(); // 10
//
//	// 
//	// a - компілятор розуміє, що об'єкт з типом Array
//	// 20 - компілятор визначає, що це літерал типу інт
//	// += - така операція існує
//
//	// ПРОБЛЕМА: компілятор бачить оператор +=, лівий операнд типу Ерей, правий операнд з типом int
//	// умовно, в компілятора є табличка, в якій записано, що робити в разі
//	// int += int OK
//	// int += double OK
//	// string += string OK
//	// простими словами, проблема в тому, що комплілятор не має гадки, що з цим усім
//	// РІШЕННЯ ПРОБЛЕМИ: надати компілятору чіткі інтрукції, що конкретно робити, якщо лівий операнд певного типу, правий операнд певного типу, а посередні якась конкретна дія (знак операції)
//	// рішення надається у вигляді функції
//	// технічна реалізація:
//	// 1) глобальна функція
//	// 2) метод класа
//	// називається цей процес перевантаженням операторів операцій
//	// перевантаженням називається тому що наша задача буде ДОДАТИ іще одну версію функції
//	// операторів операцій - тому що наставді груп операторів дуже багато (є оператори умовні, оператори циклів, оператори повернення і тд), є можливість перевантажити саме оператори операцій (таких як арифметичні операції + - * / %, операції порівняння > < == != )
//
//	// cout << a[0]; // 10
//	// cout << a[1]; // 20
//
//	// a.Print();
//	// cout << a << "\n"; // a.Print();
//	// cin >> a;
//}

// ---------------------------------------------------------

//class Array {
//	unsigned int capacity = 10; // при створенні масиву, він одразу для себе робить запас пам'яті на 10 елементів
//	int* data = new int[capacity];
//	unsigned int length = 0; // фактична (реальна) кількість елементів, присутніх у масиві
//
//public:
//	Array() {}
//
//	void AddToBack(int value) {
//		if (length < capacity) // якщо виділенної зарання пам'яті ВИСТАЧАЄ для додавання чергового елемента
//			data[length] = value;
//		else { // АЛЕ ЯКЩО МІСЦЯ ВЖЕ НЕ ВИСТАЧАЄ, ТО
//			// треба перевиділити пам'ять
//			capacity *= 2; // збільшуємо запас пам'яті у 2 рази (можна і в 1.5, можна і в 1.2)
//			// якщо був запас 10 елементів, то стане 20
//			// якщо запас був 20 елементів, то стане 40, і тд
//			int* temp = new int[capacity]; // новий масив буде в 2 рази більше по пам'яті
//			// але в старому масиві все ще усього 10 елементів, тому цикл треба написати так, щоб зачепити лише старі елементі зі старого масиву
//			for (int i = 0; i < length; i++) {
//				temp[i] = data[i];
//			}
//			// в новий масив в кінець (по індексу 10) пишеться ОДИНАДЦЯТИЙ елемент
//			temp[length] = value;
//			delete[] data; // в цілях запобігання витокам пам'яті, чистимо пам'ять від старого масиву
//			data = temp; // переставляємо покажчик на новий масив
//		}
//		length++;
//	}
//
//	void AddToFront(int value) {
//		if (length < capacity) { // ще є вільна пам'ять під черговий елмент
//			// перевиділяти пам'ять на 1 елемент кожен раз - погана ідея (якщо елементів буде більше ніж 300000+ то все буде відбуватися максимально повільно)
//			// при тому що пам'ять вже виділена (є кепесіті), то доведеться зробити зсув для всіх існуючих елементів на 1 вправо
//			for (int i = length - 1; i >= 0; i--) { // зсув іде справа наліво (тому що якщо робити його зліва направо, з початку масива в кінець) то можна втратити існуючі елементи
//				data[i + 1] = data[i];
//			}
//			data[0] = value;
//		}
//		else { // АЛЕ ЯКЩО МІСЦЯ ВЖЕ НЕ ВИСТАЧАЄ, ТО
//			// треба перевиділити пам'ять
//			capacity *= 2; // збільшуємо запас пам'яті у 2 рази (можна і в 1.5, можна і в 1.2)
//			// якщо був запас 10 елементів, то стане 20
//			// якщо запас був 20 елементів, то стане 40, і тд
//			int* temp = new int[capacity]; // новий масив буде в 2 рази більше по пам'яті
//			// але в старому масиві все ще усього 10 елементів, тому цикл треба написати так, щоб зачепити лише старі елементі зі старого масиву
//			for (int i = 0; i < length; i++) {
//				temp[i + 1] = data[i];
//			}
//			// в новий масив в початок (по індексу 0) пишеться ОДИНАДЦЯТИЙ елемент
//			temp[0] = value;
//			delete[] data; // в цілях запобігання витокам пам'яті, чистимо пам'ять від старого масиву
//			data = temp; // переставляємо покажчик на новий масив
//		}
//		length++;
//	}
//
//	void RemoveFromBack() {
//		if (length == 0) {
//			cout << "масив пустий, видаляти НЕМА ЧОГО!\n";
//			return;
//		}
//		length--;
//	}
//
//	void Print() const {
//		if (length == 0) {
//			cout << "масив пустий!\n";
//		}
//		else {
//			cout << "елементи масиву: ";
//			for (int i = 0; i < length; i++)
//			{
//				cout << data[i] << " ";
//			}
//			cout << "\n";
//		}
//	}
//
//	~Array() {
//		cout << "D-TOR\n";
//		if (data != nullptr) {
//			delete[] data;
//		}
//	}
//
//	Array(const Array& original) {
//		cout << "COPY C-TOR\n";
//		this->length = original.length;
//		this->capacity = original.capacity;
//		this->data = new int[capacity];
//		for (int i = 0; i < length; i++)
//			this->data[i] = original.data[i];
//	}
//};
//
//// загальний синтаксис як зробити перевантаження у вигляді глобальної функції
//
//// тип_результату operator значок_операції (параметри) {
//	// список дій
//// }
//
//void operator +=(Array& a, int value) {
//	cout << "HELLO FROM += function !!!\n";
//	a.AddToBack(value);
//}
//
//// не можна зробити первантаження для вже існуючих операндів
////void operator << (ostream& os, const int& a) {
////	cout << "cout << !!!\n";
////}
//
//ostream& operator << (ostream& cout, const Array& a) {
//	// cout << "cout << !!!\n";
//	a.Print();
//	return cout;
//}
//
//int main() {
//	SetConsoleOutputCP(1251);
//	srand(time(0));
//
//	Array a;
//	a.AddToBack(10);
//	a.AddToBack(20);
//	a.AddToBack(30);
//	a.Print(); // 10 20 30
//
//	int x = 10;
//	cout << x << "\n"; // 10 OK !!!
//
//	cout << a << "\n"; // 10 20 30
//	// operator << (cout, a);
//
//}

// ---------------------------------------------------------

//class Array {
//	unsigned int capacity = 10; // при створенні масиву, він одразу для себе робить запас пам'яті на 10 елементів
//	int* data = new int[capacity];
//	unsigned int length = 0; // фактична (реальна) кількість елементів, присутніх у масиві
//
//public:
//	Array() {}
//
//	void AddToBack(int value) {
//		if (length < capacity) // якщо виділенної зарання пам'яті ВИСТАЧАЄ для додавання чергового елемента
//			data[length] = value;
//		else { // АЛЕ ЯКЩО МІСЦЯ ВЖЕ НЕ ВИСТАЧАЄ, ТО
//			// треба перевиділити пам'ять
//			capacity *= 2; // збільшуємо запас пам'яті у 2 рази (можна і в 1.5, можна і в 1.2)
//			// якщо був запас 10 елементів, то стане 20
//			// якщо запас був 20 елементів, то стане 40, і тд
//			int* temp = new int[capacity]; // новий масив буде в 2 рази більше по пам'яті
//			// але в старому масиві все ще усього 10 елементів, тому цикл треба написати так, щоб зачепити лише старі елементі зі старого масиву
//			for (int i = 0; i < length; i++) {
//				temp[i] = data[i];
//			}
//			// в новий масив в кінець (по індексу 10) пишеться ОДИНАДЦЯТИЙ елемент
//			temp[length] = value;
//			delete[] data; // в цілях запобігання витокам пам'яті, чистимо пам'ять від старого масиву
//			data = temp; // переставляємо покажчик на новий масив
//		}
//		length++;
//	}
//
//	void AddToFront(int value) {
//		if (length < capacity) { // ще є вільна пам'ять під черговий елмент
//			// перевиділяти пам'ять на 1 елемент кожен раз - погана ідея (якщо елементів буде більше ніж 300000+ то все буде відбуватися максимально повільно)
//			// при тому що пам'ять вже виділена (є кепесіті), то доведеться зробити зсув для всіх існуючих елементів на 1 вправо
//			for (int i = length - 1; i >= 0; i--) { // зсув іде справа наліво (тому що якщо робити його зліва направо, з початку масива в кінець) то можна втратити існуючі елементи
//				data[i + 1] = data[i];
//			}
//			data[0] = value;
//		}
//		else { // АЛЕ ЯКЩО МІСЦЯ ВЖЕ НЕ ВИСТАЧАЄ, ТО
//			// треба перевиділити пам'ять
//			capacity *= 2; // збільшуємо запас пам'яті у 2 рази (можна і в 1.5, можна і в 1.2)
//			// якщо був запас 10 елементів, то стане 20
//			// якщо запас був 20 елементів, то стане 40, і тд
//			int* temp = new int[capacity]; // новий масив буде в 2 рази більше по пам'яті
//			// але в старому масиві все ще усього 10 елементів, тому цикл треба написати так, щоб зачепити лише старі елементі зі старого масиву
//			for (int i = 0; i < length; i++) {
//				temp[i + 1] = data[i];
//			}
//			// в новий масив в початок (по індексу 0) пишеться ОДИНАДЦЯТИЙ елемент
//			temp[0] = value;
//			delete[] data; // в цілях запобігання витокам пам'яті, чистимо пам'ять від старого масиву
//			data = temp; // переставляємо покажчик на новий масив
//		}
//		length++;
//	}
//
//	void RemoveFromBack() {
//		if (length == 0) {
//			cout << "масив пустий, видаляти НЕМА ЧОГО!\n";
//			return;
//		}
//		length--;
//	}
//
//	void Print() const {
//		if (length == 0) {
//			cout << "масив пустий!\n";
//		}
//		else {
//			cout << "елементи масиву: ";
//			for (int i = 0; i < length; i++)
//			{
//				cout << data[i] << " ";
//			}
//			cout << "\n";
//		}
//	}
//
//	~Array() {
//		cout << "D-TOR\n";
//		if (data != nullptr) {
//			delete[] data;
//		}
//	}
//
//	Array(const Array& original) {
//		cout << "COPY C-TOR\n";
//		this->length = original.length;
//		this->capacity = original.capacity;
//		this->data = new int[capacity];
//		for (int i = 0; i < length; i++)
//			this->data[i] = original.data[i];
//	}
//
//	void Clear() {
//		delete[] data;
//		data = nullptr;
//		length = 0;
//		capacity = 0;
//	}
//
//	unsigned int GetLength() const {
//		return length;
//	}
//};
//
//// загальний синтаксис як зробити перевантаження у вигляді глобальної функції
//
//// тип_результату operator значок_операції (параметри) {
//	// список дій
//// }
//
//void operator +=(Array& a, int value) {
//	cout << "HELLO FROM += function !!!\n";
//	a.AddToBack(value);
//}
//
//// не можна зробити первантаження для вже існуючих операндів
////void operator << (ostream& os, const int& a) {
////	cout << "cout << !!!\n";
////}
//
//ostream& operator << (ostream& cout, const Array& a) {
//	// cout << "cout << !!!\n";
//	a.Print();
//	return cout;
//}
//
//void operator >> (istream& cin, Array& a) {
//	cout << "cin >> !!!\n";
//	// a.Array::~Array(); // явний виклик деструктора
//	// a.Clear();
//	while (a.GetLength() > 0) {
//		a.RemoveFromBack();
//	}
//	int count;
//	cout << "How many elements do you need? ";
//	cin >> count; // 5
//	for (int i = 0; i < count; i++)
//	{
//		int value;
//		cout << "Please, enter value for element # " << i << ": ";
//		cin >> value;
//		a.AddToBack(value);
//	}
//}
//
//int main() {
//	SetConsoleOutputCP(1251);
//	srand(time(0));
//
//	Array a;
//	cin >> a;
//	// operator >> (cin, a);
//
//	cout << a;
//}

// ---------------------------------------------------------